apache/nuttx/arch/arm/src/stm32l5/hardware/stm32l562xx_rcc.h
/* AHB3 Peripheral Clock enable register */

#define RCC_AHB3ENR_FMCEN                (1 << 0)  /* Bit 0: Flexible memory controller module enable */
#define RCC_AHB3ENR_OSPI1EN              (1 << 8)  /* Bit 8: OCTOSPI1 module enable */

/* APB1 Peripheral Clock enable register 1 */

#define RCC_APB1ENR1_TIM2EN              (1 << 0)  /* Bit 0:  TIM2 enable */
#define RCC_APB1ENR1_TIM3EN              (1 << 1)  /* Bit 1:  TIM3 enable */
#define RCC_APB1ENR1_TIM4EN              (1 << 2)  /* Bit 2:  TIM4 enable */
#define RCC_APB1ENR1_TIM5EN              (1 << 3)  /* Bit 3:  TIM5 enable */
#define RCC_APB1ENR1_TIM6EN              (1 << 4)  /* Bit 4:  TIM6 enable */
#define RCC_APB1ENR1_TIM7EN              (1 << 5)  /* Bit 5:  TIM7 enable */
#define RCC_APB1ENR1_RTCAPBEN            (1 << 10) /* Bit 10: RTC APB clock enable */
#define RCC_APB1ENR1_WWDGEN              (1 << 11) /* Bit 11: Windowed Watchdog enable */
#define RCC_APB1ENR1_SPI2EN              (1 << 14) /* Bit 14: SPI2 enable */
#define RCC_APB1ENR1_SPI3EN              (1 << 15) /* Bit 15: SPI3 enable */
#define RCC_APB1ENR1_USART2EN            (1 << 17) /* Bit 17: USART2 enable */
#define RCC_APB1ENR1_USART3EN            (1 << 18) /* Bit 18: USART3 enable */
#define RCC_APB1ENR1_UART4EN             (1 << 19) /* Bit 19: USART4 enable */
#define RCC_APB1ENR1_UART5EN             (1 << 20) /* Bit 20: USART5 enable */
#define RCC_APB1ENR1_I2C1EN              (1 << 21) /* Bit 21: I2C1 enable */
#define RCC_APB1ENR1_I2C2EN              (1 << 22) /* Bit 22: I2C2 enable */
#define RCC_APB1ENR1_I2C3EN              (1 << 23) /* Bit 23: I2C3 enable */
#define RCC_APB1ENR1_CRSEN               (1 << 24) /* Bit 24: CRSEN enable */
#define RCC_APB1ENR1_PWREN               (1 << 28) /* Bit 28: Power interface enable */
#define RCC_APB1ENR1_DAC1EN              (1 << 29) /* Bit 29: DAC1 enable */
#define RCC_APB1ENR1_OPAMPEN             (1 << 30) /* Bit 30: OPAMP enable */
#define RCC_APB1ENR1_LPTIM1EN            (1 << 31) /* Bit 31: Low-power Timer 1 enable */

/* APB1 Peripheral Clock enable register 2 */

#define RCC_APB1ENR2_LPUART1EN           (1 << 0)  /* Bit 0:  Low-power UART 1 enable */
#define RCC_APB1ENR2_I2C4EN              (1 << 1)  /* Bit 1:  I2C4 enable */
#define RCC_APB1ENR2_LPTIM2EN            (1 << 5)  /* Bit 5:  Low-power Timer 2 enable */
#define RCC_APB1ENR2_LPTIM3EN            (1 << 6)  /* Bit 6:  Low-power Timer 3 enable */
#define RCC_APB1ENR2_FDCAN1EN            (1 << 9)  /* Bit 9:  FDCAN1 enable */
#define RCC_APB1ENR2_USBFSEN             (1 << 21) /* Bit 21: USB FS enable */
#define RCC_APB1ENR2_UCPD1EN             (1 << 23) /* Bit 23: UCPD1 enable */

/* APB2 Peripheral Clock enable register */

#define RCC_APB2ENR_SYSCFGEN             (1 << 0)  /* Bit 0:  SYSCFG + COMP + VREFBUF enable */
#define RCC_APB2ENR_TIM1EN               (1 << 11) /* Bit 11: TIM1 enable */
#define RCC_APB2ENR_SPI1EN               (1 << 12) /* Bit 12: SPI1 enable */
#define RCC_APB2ENR_TIM8EN               (1 << 13) /* Bit 13: TIM8 enable */
#define RCC_APB2ENR_USART1EN             (1 << 14) /* Bit 14: USART1 enable */
#define RCC_APB2ENR_TIM15EN              (1 << 16) /* Bit 16: TIM15 enable */
#define RCC_APB2ENR_TIM16EN              (1 << 17) /* Bit 17: TIM16 enable */
#define RCC_APB2ENR_TIM17EN              (1 << 18) /* Bit 18: TIM17 enable */
#define RCC_APB2ENR_SAI1EN               (1 << 21) /* Bit 21: SAI1 enable */
#define RCC_APB2ENR_SAI2EN               (1 << 22) /* Bit 22: SAI2 enable */
#define RCC_APB2ENR_DFSDM1EN             (1 << 24) /* Bit 24: DFSDM1 enable */

/* RCC AHB1 Sleep and Stop modes peripheral clock enable register */

#define RCC_AHB1SMENR_DMA1SMEN           (1 << 0)  /* Bit 0:  DMA1 enable during Sleep mode */
#define RCC_AHB1SMENR_DMA2SMEN           (1 << 1)  /* Bit 1:  DMA2 enable during Sleep mode */
#define RCC_AHB1SMENR_DMAMUX1SMEN        (1 << 2)  /* Bit 2:  DMAMUX1 enable during Sleep mode */
#define RCC_AHB1SMENR_FLASHSMEN          (1 << 8)  /* Bit 8:  Flash memory interface enable during Sleep mode */
#define RCC_AHB1SMENR_SRAM1SMEN          (1 << 9)  /* Bit 9:  SRAM1 enable during Sleep mode */
#define RCC_AHB1SMENR_CRCSMEN            (1 << 12) /* Bit 12: CRC enable during Sleep mode */
#define RCC_AHB1SMENR_TSCSMEN            (1 << 16) /* Bit 16: Touch sensing controller enable during Sleep mode */
#define RCC_AHB1SMENR_GTZCSMEN           (1 << 22) /* Bit 22: GTZC enable during Sleep mode */
#define RCC_AHB1SMENR_ICACHESMEN         (1 << 23) /* Bit 23: Instruction cache enable during Sleep mode */

/* RCC AHB2 low power mode peripheral clock enable register */

#define RCC_AHB2SMENR_GPIOASMEN          (1 << 0)  /* Bit 0:  IO port A enable during Sleep mode */
#define RCC_AHB2SMENR_GPIOBSMEN          (1 << 1)  /* Bit 1:  IO port B enable during Sleep mode */
#define RCC_AHB2SMENR_GPIOCSMEN          (1 << 2)  /* Bit 2:  IO port C enable during Sleep mode */
#define RCC_AHB2SMENR_GPIODSMEN          (1 << 3)  /* Bit 3:  IO port D enable during Sleep mode */
#define RCC_AHB2SMENR_GPIOESMEN          (1 << 4)  /* Bit 4:  IO port E enable during Sleep mode */
#define RCC_AHB2SMENR_GPIOFSMEN          (1 << 5)  /* Bit 5:  IO port F enable during Sleep mode */
#define RCC_AHB2SMENR_GPIOGSMEN          (1 << 6)  /* Bit 6:  IO port G enable during Sleep mode */
#define RCC_AHB2SMENR_GPIOHSMEN          (1 << 7)  /* Bit 7:  IO port H enable during Sleep mode */
#define RCC_AHB2SMENR_SRAM2SMEN          (1 << 9)  /* Bit 9:  SRAM2 enable during Sleep mode */
#define RCC_AHB2SMENR_ADCSMEN            (1 << 13) /* Bit 13: ADC interface enable during Sleep mode (common to all ADCs) */
#define RCC_AHB2SMENR_AESSMEN            (1 << 16) /* Bit 16: AES Cryptographic module enable during Sleep mode */
#define RCC_AHB2SMENR_HASHSMEN           (1 << 17) /* Bit 17: HASH module enable during Sleep mode */
#define RCC_AHB2SMENR_RNGSMEN            (1 << 18) /* Bit 18: Random number generator module enable during Sleep mode */
#define RCC_AHB2SMENR_PKASMEN            (1 << 19) /* Bit 19: PKA module enable during Sleep mode */
#define RCC_AHB2SMENR_OTFDEC1SMEN        (1 << 21) /* Bit 21: OTFDEC1 module enable during Sleep mode */
#define RCC_AHB2SMENR_SDMMC1SMEN         (1 << 22) /* Bit 22: SDMMC1 module enable during Sleep mode */

/* RCC AHB3 low power mode peripheral clock enable register */

#define RCC_AHB3SMENR_FMCSMEN            (1 << 0)  /* Bit 0: Flexible memory controller module enable during Sleep mode */
#define RCC_AHB3SMENR_OSPISMEN           (1 << 8)  /* Bit 8: OCTOSPI1 module enable during Sleep mode */

/* RCC APB1 low power mode peripheral clock enable register 1 */

